app/confluence.yml
---
settings:
  artifacts-dir: results/confluence/%Y-%m-%d_%H-%M-%S
  aggregator: consolidator
  verbose: false
  check-updates: false                 # disable bzt check for updates
  env:
    application_hostname: ac2f4830be218440eb53d42065afaca3-675340632.us-east-2.elb.amazonaws.com
    application_protocol: http         # http or https
    application_port: 80               # 80, 443, 8080, 1990, etc
    secure: False                       # Set False to allow insecure connections, e.g. when using self-signed SSL certificate
    application_postfix: /confluence   # e.g. /confluence for TerraForm deployment url like `http://a1234-54321.us-east-2.elb.amazonaws.com/confluence`. Leave this value blank for url without postfix.
    admin_login: admin
    admin_password: admin
    load_executor: locust              # jmeter and locust are supported. jmeter by default.
    concurrency: 2                   # number of concurrent virtual users for jmeter or locust scenario
    test_duration: 5m
    ramp-up: 5s                        # time to spin all concurrent users
    total_actions_per_hour: 2000
    WEBDRIVER_VISIBLE: True
    JMETER_VERSION: 5.6.3
    LANGUAGE: en_US.utf8
    allow_analytics: Yes               # Allow sending basic run analytics to Atlassian. These analytics help us to understand how the tool is being used and help us to continue to invest in this tooling. For more details please see our README.
    environment_compliance_check: True # Pre-test environment compliance validation. Set to "False" to skip it.
    extended_metrics: False
    # Action percentage for JMeter and Locust load executors
    view_page: 33
    view_dashboard: 10
    view_blog: 13
    search_cql: 4
    create_blog: 5
    create_and_edit_page: 9
    comment_page: 8
    view_attachment: 6
    upload_attachment: 7
    like_page: 3
    upload_emoticon: 4      # For Confluence 8.4.x+
    standalone_extension: 5 # By default disabled
    # Custom dataset section.
    # Write CQL query to add CQL output to the app/datasets/confluence/custom_pages.csv, e.g. "title ~ 'AppPage*'"
    custom_dataset_query: "title ~ 'sourceEditor*'"
services:
  - module: shellexec
    prepare:
      - python util/pre_run/environment_checker.py
      - python util/pre_run/environment_compliance_check.py confluence
      - python util/data_preparation/confluence_prepare_data.py
    shutdown:
      - python util/post_run/jmeter_post_check.py
      - python util/jtl_convertor/jtls-to-csv.py kpi.jtl selenium.jtl
    post-process:
      - python util/analytics/analytics.py confluence
      - python util/post_run/cleanup_results_dir.py
  - module: pip-install
    packages:
      - selenium==4.25.0
execution:
  - scenario: ${load_executor}
    executor: ${load_executor}
    concurrency: ${concurrency}
    hold-for: ${test_duration}
    ramp-up: ${ramp-up}
  - scenario: selenium
    executor: selenium
    runner: pytest
    hold-for: ${test_duration}
scenarios:
  selenium:
    script: selenium_ui/confluence_ui.py
  locust:
    script: locustio/confluence/locustfile.py
  jmeter:
    script: jmeter/confluence.jmx
    properties:
      application_hostname: ${application_hostname}
      application_protocol: ${application_protocol}
      application_port: ${application_port}
      application_postfix: ${application_postfix}
      # Workload model
      total_actions_per_hr: ${total_actions_per_hour}
      perc_view_page: ${view_page}
      perc_view_dashboard: ${view_dashboard}
      perc_view_blog: ${view_blog}
      perc_search_cql: ${search_cql}
      perc_create_blog: ${create_blog}
      perc_create_and_edit_page: ${create_and_edit_page}
      perc_comment_page: ${comment_page}
      perc_view_attachment: ${view_attachment}
      perc_upload_attachment: ${upload_attachment}
      perc_like_page: ${like_page}
      perc_upload_emoticon: ${upload_emoticon}
      perc_standalone_extension: ${standalone_extension}
modules:
  consolidator:
    rtimes-len: 0 # CONFSRVDEV-7631 reduce sampling
    percentiles: [] # CONFSRVDEV-7631 disable all percentiles due to Taurus's excessive memory usage
  jmeter:
    version: ${JMETER_VERSION}
    detect-plugins: true
    memory-xmx: 8G  # allow JMeter to use up to 8G of memory
    plugins:
      - jpgc-casutg=2.10
      - jpgc-dummy=0.4
      - jpgc-ffw=2.0
      - jpgc-fifo=0.2
      - jpgc-functions=2.2
      - jpgc-json=2.7
      - jpgc-perfmon=2.1
      - jpgc-prmctl=0.4
      - jpgc-tst=2.6
      - bzm-random-csv=0.8    # not used default jmx file
    system-properties:
      server.rmi.ssl.disable: true
      java.rmi.server.hostname: localhost
      httpsampler.ignore_failed_embedded_resources: "true"
  selenium:
    chromedriver:
      version: "130.0.6723.91" # Supports Chrome version 130. You can refer to https://googlechromelabs.github.io/chrome-for-testing
reporting:
- data-source: sample-labels
  module: junit-xml
- module: passfail
  criteria:
  - failures>25% over 300s, stop as failed